# yolo11-DBRF_PF-P2_Detail-C3k2_RFAConv.yaml

# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 OBB model with P2-P5 outputs
# Paper-aligned naming version:
# Backbone: C3k2_RFAConv
# Neck: DBRF-PF
# Unit: RPFU
# Branch: P2-Detail Branch

# Parameters
nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# --------------------------------------------------
# Backbone: C3k2_RFAConv
# --------------------------------------------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1  P2/4
  - [-1, 2, C3k2_RFAConv, [256, False, 0.25]]    # 2  P2/4 output

  - [-1, 1, Conv, [256, 3, 2]]                   # 3  P3/8
  - [-1, 2, C3k2_RFAConv, [512, False, 0.25]]    # 4  P3/8 output

  - [-1, 1, Conv, [512, 3, 2]]                   # 5  P4/16
  - [-1, 2, C3k2_RFAConv, [512, True]]           # 6  P4/16 output

  - [-1, 1, Conv, [1024, 3, 2]]                  # 7  P5/32
  - [-1, 2, C3k2_RFAConv, [1024, True]]          # 8  P5/32 output

  - [-1, 1, SPPF, [1024, 5]]                     # 9
  - [-1, 2, C2PSA, [1024]]                       # 10

# --------------------------------------------------
# Neck: DBRF-PF
# PF is implemented by Concat
# RPFU is the lightweight re-fusion processing unit
# --------------------------------------------------
head:
  # ==== Stage 1: top-down re-fusion ====
  # P5 node
  - [-1, 1, Conv, [512, 1, 1]]                   # 11: reduce C2PSA output to 512 channels

  # Build T5 (1/32)
  - [6, 1, GSConv, [512, 3, 2]]                  # 12: downsample P4 to 1/32
  - [[-1, 11], 1, Concat, [1]]                   # 13: PF(T4_down, top feature)
  - [-1, 3, RPFU, [512]]                         # 14: T5 output (512ch, 1/32)

  # Build T4 (1/16)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 15: upsample T5 to 1/16
  - [4, 1, GSConv, [256, 3, 2]]                  # 16: downsample P3 to 1/16
  - [[15, -1, 6], 1, Concat, [1]]                # 17: PF(T5_up, P3_down, P4)
  - [-1, 3, RPFU, [512]]                         # 18: T4 output (512ch, 1/16)

  # Build T3 (1/8)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 19: upsample T4 to 1/8
  - [[-1, 4], 1, Concat, [1]]                    # 20: PF(T4_up, P3)
  - [-1, 3, RPFU, [256]]                         # 21: T3 output (256ch, 1/8)

  # ==== P2-Detail Branch ====
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 22: upsample T3 to 1/4
  - [[-1, 2], 1, Concat, [1]]                    # 23: PF(T3_up, P2)
  - [-1,2, RPFU, [128]]                         # 24: F2 / P2 output (128ch, 1/4)

  # ==== Stage 2: bottom-up re-fusion ====
  # F2 -> F3
  - [-1, 1, GSConv, [256, 3, 2]]                 # 25: downsample F2 to 1/8
  - [[-1, 21], 1, Concat, [1]]                   # 26: PF(F2_down, T3)
  - [-1, 2, RPFU, [256]]                         # 27: F3 output (256ch, 1/8)

  # F3 -> F4
  - [21, 1, GSConv, [256, 3, 2]]                 # 28: downsample T3 to 1/16
  - [27, 1, GSConv, [256, 3, 2]]                 # 29: downsample F3 to 1/16
  - [[18, 28, -1], 1, Concat, [1]]               # 30: PF(T4, T3_down, F3_down)
  - [-1, 3, RPFU, [512]]                         # 31: F4 output (512ch, 1/16)

  # F4 -> F5
  - [18, 1, GSConv, [512, 3, 2]]                 # 32: downsample T4 to 1/32
  - [31, 1, GSConv, [512, 3, 2]]                 # 33: downsample F4 to 1/32
  - [[14, 32, -1], 1, Concat, [1]]               # 34: PF(T5, T4_down, F4_down)
  - [-1, 3, RPFU, [1024]]                        # 35: F5 output (1024ch, 1/32)

  # OBB Head
  - [[24, 27, 31, 35], 1, OBB, [nc, 1]]          # Detect(P2, P3, P4, P5)
